controllers/ClienteController.php

    public function actionProyectos($rutCliente)
    {
        SiteController::valid();
        $cliente = Cliente::find()->where([
            'rutCliente' => $rutCliente
        ])->one();
        $model1 = Proyectos::find()->where([
            'rutCliente' => $rutCliente
        ])->andWhere(["estado" => 1])->all();
        $model2 = Proyectos::find()->where([
            'rutCliente' => $rutCliente
        ])->andWhere(["estado" => 2])->all();
        $model3 = Proyectos::find()->where([
            'rutCliente' => $rutCliente
        ])->andWhere(["estado" => 3])->all();
---
SELECT * FROM `cliente` WHERE `rutCliente`='20000003'
SELECT * FROM `proyectos` WHERE (`rutCliente`='20000003') AND (`estado`=1)
SELECT * FROM `proyectos` WHERE (`rutCliente`='20000003') AND (`estado`=2)
SELECT * FROM `proyectos` WHERE (`rutCliente`='20000003') AND (`estado`=3)