controllers/CotizacionController.php

    public function actionContar()
    {
        $cventas = NotaVenta::find()->count();
        $tcompras = OrdenIngreso::find()->sum('Total');
        $tventas = NotaVenta::find()->sum('Total');

        $cventas = NotaVenta::find()->count();
        $ccompras = OrdenIngreso::find()->count();
        $ccotizaciones = Cotizacion::find()->count();
---
SELECT COUNT(*) FROM `NotaVenta`
SELECT SUM(Total) FROM `ordenIngreso`
SELECT SUM(Total) FROM `NotaVenta`
SELECT COUNT(*) FROM `ordenIngreso`
SELECT COUNT(*) FROM `cotizacion`