controllers/SiteController.php

SELECT * FROM `Usuario` WHERE (`correo`='Admin@sibotec.cl') AND (`clave`='1')
---
    public function actionLogin()
    {



        $model = new Usuario();

        if ($model->load(Yii::$app->request->post())) {

            $valid = Usuario::find()
                ->where(['correo' => Yii::$app->request->post()["Usuario"]["correo"]])
                ->andWhere(['clave' => Yii::$app->request->post()["Usuario"]["clave"]])
                ->one();