views/site/inicio.php

SELECT * FROM `cliente`
---
            <div class="row" id="myItems">
                <?php

                $model = Cliente::find()->all();